ednieuw/Fibonacci-Nano-ESP32-clock/Old/ESP32ArduinoFibonacci_V009a/ESP32ArduinoFibonacci_V009.ino
 }
//--------------------------------------------
// KEYPAD check for Keypad input
//--------------------------------------------                           
void Keypad3x1Check(void)
{ 
// digitalWrite(COLPIN,LOW);                                                                  // Mimic a key press on pin 6 in order to select the first column
 char Key = keypad.getKey();
 if(Key)
  {
   Tekstprintlnf("Key: %s", Key);
   if (Key == 'Y')    ProcessKeyPressTurn(0);                                                 // Pressing Middle button Yellow activates the keyboard input.   
   else if (ChangeTime)    
     { 
      if (Key == 'R') ProcessKeyPressTurn(1);                                                 // Pressing Red increases hour or minute. 
      if (Key == 'G') ProcessKeyPressTurn(-1);                                                // Pressing Green decreases hour or minute. 
     }
   delay(200);
  }
} 
//--------------------------------------------                                                //
// KY-040 ROTARY encoder Init 
//--------------------------------------------
 void InitRotaryMod(void)
 {
 pinMode(encoderPinA,  INPUT_PULLUP);
 pinMode(encoderPinB,  INPUT_PULLUP);  
 pinMode(clearButton,  INPUT_PULLUP); 
 myEnc.write(0);                                                                              // Clear Rotary encoder buffer
 snprintf(sptext, sizeof(sptext),"Rotary %s used", Mem.TimeInput==1?"IS":"NOT");
 
 } 
//--------------------------------------------                                                //
// KY-040 ROTARY check if the rotary is moving
//--------------------------------------------
void RotaryEncoderCheck(void)
{
 int ActionPress = 999;
 if (digitalRead(clearButton) == LOW )          ProcessKeyPressTurn(0);                       // Set the time by pressing rotary button
 else if (ChangeTime || ChangeLightIntensity)    
  {   
   ActionPress = myEnc.read();                                                                // If the knob is turned store the direction (-1 or 1)
   if (ActionPress == 0) {  ActionPress = 999;  ProcessKeyPressTurn(ActionPress);  }          // Sent 999 = nop (no operation) 
   if (ActionPress == 1 || ActionPress == -1 )  ProcessKeyPressTurn(ActionPress);             // Process the ActionPress
  } 
 myEnc.write(0);                                                                              // Set encoder pos back to 0

if ((unsigned long) (millis() - RotaryPressTimer) > 60000)                                    // After 60 sec after shaft is pressed time of light intensity can not be changed 
   {
    if (ChangeTime || ChangeLightIntensity)                         
      {
        Tekstprintln("<-- Changing time is over -->");
        NoofRotaryPressed = 0;
      }
    ChangeTime            = false;
    ChangeLightIntensity  = false;
   }   
}

//--------------------------------------------                                                //
// CLOCK KY-040 Rotary or Membrane 3x1 processing input
// encoderPos < 1 left minus 
// encoderPos = 0 attention and selection choice
// encoderPos > 1 right plus
//--------------------------------------------
void ProcessKeyPressTurn(int encoderPos)
{
 if (ChangeTime || ChangeLightIntensity)                                                      // If shaft is pressed time of light intensity can be changed
   {
    if ( encoderPos!=999 && ( (millis() - Looptime) > 250))                                   // If rotary turned avoid debounce within 0.25 sec
     {   
     Tekstprintlnf("----> Index: %d", encoderPos);
     if (encoderPos == 1)                                                                     // Increase  
       {     
        if (ChangeLightIntensity)  { WriteLightReducer(5); }                                  // If time < 60 sec then adjust light intensity factor
        if (ChangeTime) 
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
              {if( ++timeinfo.tm_hour >23) { timeinfo.tm_hour = 0; } }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
              {  timeinfo.tm_sec = 0;
               if( ++timeinfo.tm_min  >59) 
                 { timeinfo.tm_min  = 0; if( timeinfo.tm_hour >=23) { timeinfo.tm_hour = 0; } }   
              }
           } 
        }    
      if (encoderPos == -1)                                                                   // Decrease
       {
       if (ChangeLightIntensity)   { WriteLightReducer(-5); }                                 // If time < 60 sec then adjust light intensity factor
       if (ChangeTime)     
          {
           if (NoofRotaryPressed == 1)                                                        // Change hours
             {if( timeinfo.tm_hour-- ==0)  { timeinfo.tm_hour = 23; }  }      
           if (NoofRotaryPressed == 2)                                                        // Change minutes
             { 
              timeinfo.tm_sec = 0;
              if( timeinfo.tm_min-- == 0) 
                { timeinfo.tm_min  = 59; if( timeinfo.tm_hour  == 0) { timeinfo.tm_hour = 23; } }
             } 
           }          
        } 
      SetDS3231Time();  
      Displaytime();Tekstprintln("");
      Looptime = millis();    
     }                                                     
   }
 if (encoderPos == 0 )                                                                        // Set the time by pressing rotary button
   { 
    delay(250);
    ChangeTime            = false;
    ChangeLightIntensity  = false;
    RotaryPressTimer      = millis();                                                         // Record the time the shaft was pressed.
    if(++NoofRotaryPressed > 9) NoofRotaryPressed = 0;
    switch (NoofRotaryPressed)                                                                // No of times the rotary is pressed
      {
       case 1:  ChangeTime = true;                  break;  
       case 2:  ChangeTime = true;                  break;    
       case 3:  ChangeLightIntensity = true;        break;   
       case 4:                                                      break;                    // 
       case 5:                                                      break;                    // 
       case 6:                                                      break;                    // 
       case 7:                                                      break;                    //                                
       case 8:                                                      break;
       case 9:  Reset();                                            break;                    // Reset all settings                                                                  
      default:                                                      break;                     
      }
    Tekstprintlnf("NoofRotaryPressed: %d",NoofRotaryPressed);   
    Looptime = millis();     
    Displaytime();  Tekstprintln("");                                                                          // Turn on the LEDs with proper time
   }
 }

//--------------------------------------------                                                //
// IR-RECEIVER Start alarge or tiny IR-RECEIVER 
// Copy the to be used ButtonNames for a small or large IR-receiver
//--------------------------------------------
void Start_IRreceiver(void)
{
 if (Mem.TimeInput==3) Init_IRreceiver(ButtonLNames, sizeof(ButtonLNames) / sizeof(ButtonLNames[0]));
 if (Mem.TimeInput==4) Init_IRreceiver(ButtonTNames, sizeof(ButtonTNames) / sizeof(ButtonTNames[0]));
}

//--------------------------------------------                                                //
// IR-RECEIVER Init
//--------------------------------------------
void Init_IRreceiver(String* ButtonTempNames, byte numButtons)
{
 ButtonNames = ButtonTempNames;  // Store pointer
 NOOFBUTTONS = numButtons;
 IrReceiver.begin(IRReceiverPin);

 if (Mem.TimeInput == 3 || Mem.TimeInput == 4)  {  GetIRRemoteFromFlashMemory(); }            // Load IR settings (only if IR remote is enabled)
 if (IRMem.remoteIdentified && IRMem.buttons[0].learned)                                      // Check if we already have learned buttons
  {
   learningMode = false;
   //PrintAllMappings();
   snprintf(sptext, sizeof(sptext), "Remote identified - Protocol: %s", getProtocolString((decode_type_t) IRMem.learnedRemoteProtocol));
   Tekstprintlnf("Remote identified - Protocol: %s", getProtocolString((decode_type_t) IRMem.learnedRemoteProtocol));
  }
}

//--------------------------------------------                                                //
// IR-RECEIVER Decode received signal,
// routes to learning or recognition mode and return code
//--------------------------------------------
uint16_t IrReceiverDecode(void)
{
 uint16_t command = 0; 
 if (IrReceiver.decode()) 
    {
                     command = IrReceiver.decodedIRData.command;
      uint16_t address       = IrReceiver.decodedIRData.address;
      decode_type_t protocol = IrReceiver.decodedIRData.protocol;
      if (!(IrReceiver.decodedIRData.flags & IRDATA_FLAGS_IS_REPEAT))                         // Ignore repeat codes
        {
         if (learningMode)  { ProcessLearningMode(protocol, command, address);  }
         else               { ProcessRecognitionMode(protocol, command, address);  }
        }
      delay(100);
      IrReceiver.resume();
    }
 return command;
}

//============================================
// IR-RECEIVER Internal function - Handles learning mode
// Validates remote matches, Saves when complete
//============================================
void ProcessLearningMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  // First button press - identify the remote control
  if (!IRMem.remoteIdentified)
  {
    IRMem.learnedRemoteAddress = address;
    IRMem.learnedRemoteProtocol = (uint8_t)protocol;
    IRMem.remoteIdentified = true;
    Tekstprintlnf("Remote identified - Protocol: %s, Address: 0x%04X", getProtocolString(protocol), address);
  }
  else
  {
    if (address != IRMem.learnedRemoteAddress || protocol != (decode_type_t)IRMem.learnedRemoteProtocol)    // Check if this is from the same remote
    {
      Tekstprintln("⚠ Wrong remote! Please use the same remote control.");
      Tekstprintlnf("Expected Address: 0x%04X, Got: 0x%04X", IRMem.learnedRemoteAddress, address);
      return;
    }
  }
  IRMem.buttons[currentLearningIndex].protocol = (uint8_t)protocol;                           // Store the button mapping
  IRMem.buttons[currentLearningIndex].command = command;
  IRMem.buttons[currentLearningIndex].address = address;
  IRMem.buttons[currentLearningIndex].learned = true;
  
  Tekstprintlnf("✓ Learned '%s' - Protocol: %s, Command: 0x%04X, Address: 0x%04X", 
          ButtonNames[currentLearningIndex].c_str(), getProtocolString(protocol), command, address);
  currentLearningIndex++;
  if (currentLearningIndex < NOOFBUTTONS)
  {
    Tekstprintlnf("\nPlease press button: %s", ButtonNames[currentLearningIndex].c_str());
  }
  else
  {
    learningMode = false;                                                                     // Learning complete
    StoreIRRemoteInFlashMemory();
    Tekstprintln("\n=== Learning Complete & Saved! ===");
    Tekstprintln("\nStored Button Mappings:");
    PrintAllMappings();
    Tekstprintln("\n=== Now in Recognition Mode ===");
    Tekstprintlnf("Only responding to remote with Address: 0x%04X", IRMem.learnedRemoteAddress);
    Tekstprintln("Press POWER to activate the remote.      = POWER ON");
    Tekstprintln("After 5 minutes remote auto powers down. = POWER OFF");         
    Tekstprintln("With POWER OFF the digits will change the Display choice");     
  }
}

//============================================
// IR-RECEIVER Internal function - handles recognition mode
// Validates remote address Calls RecognizeButton
//============================================
void ProcessRecognitionMode(decode_type_t protocol, uint16_t command, uint16_t address)
{
  if (address != IRMem.learnedRemoteAddress || 
     protocol != (decode_type_t) IRMem.learnedRemoteProtocol)                                 // Check if it's from the learned remote
  {
    snprintf(sptext, sizeof(sptext), "⚠ Ignored - Wrong remote (Address: 0x%04X)", address);
    if (address!=0) Tekstprintln(sptext);                                                     // Stray input detected
  }
  else {RecognizeButton(protocol, command, address);  }                                       // Correct remote - identify which button was pressed
}

//--------------------------------------------                                                //
// IR-RECEIVER Initializes learning mode
// Resets all button data, Prompts for first button
//--------------------------------------------
void StartIRLearning(void)
{
 Tekstprintln("\n=== Starting Learning Mode ===");
 currentLearningIndex = 0;
 learningMode = true;
 IRMem.remoteIdentified = false;
 for (int i = 0; i < NOOFBUTTONS; i++) {IRMem.buttons[i].learned = false; }
 Tekstprintlnf("Please press button: %s", ButtonNames[0].c_str());
}

//--------------------------------------------                                                //
// IR-RECEIVER Shows learned buttons
//--------------------------------------------
void PrintAllMappings(void)
{
 if (!IRMem.remoteIdentified) {Tekstprintln("No remote learned yet!");  return; }
 PrintLine(35);
 Tekstprintlnf( "IR-Remote Address: 0x%04X", IRMem.learnedRemoteAddress);
 Tekstprintlnf( "IR-Remote Protocol: %s", getProtocolString( (decode_type_t) IRMem.learnedRemoteProtocol));
 PrintLine(35);
 for (int i = 0; i < NOOFBUTTONS; i++)
    if (IRMem.buttons[i].learned)
      Tekstprintlnf( "%s\t-> Cmd: 0x%04X", ButtonNames[i].c_str(), IRMem.buttons[i].command);    
  PrintLine(35);
}

//--------------------------------------------                                                //
// IR-RECEIVER Reset all settings
//--------------------------------------------
void ResetAllIRremoteSettings(void)
{
 Tekstprintln("\n=== Resetting All IR remote Data ===");
 IRMem.remoteIdentified = false;
 IRMem.learnedRemoteAddress = 0;
 IRMem.learnedRemoteProtocol = 0;
 for (int i = 0; i < NOOFBUTTONS; i++)
  {
    IRMem.buttons[i].learned = false;
    IRMem.buttons[i].protocol = 0;
    IRMem.buttons[i].command = 0;
    IRMem.buttons[i].address = 0;
  }
  
  StoreIRRemoteInFlashMemory();
  Tekstprintln("✓ IR remote reset complete.");   
  learningMode = false;
}


//--------------------------------------------                                                //
// IR-RECEIVER Identifies button pressed
//--------------------------------------------
int RecognizeButton(decode_type_t protocol, uint16_t command, uint16_t address)
{
  bool found = false;
  for (int i = 0; i < NOOFBUTTONS; i++)
  {
    if (IRMem.buttons[i].learned && 
        IRMem.buttons[i].protocol == (uint8_t)protocol &&
        IRMem.buttons[i].command == command && 
        IRMem.buttons[i].address == address)
    {
      Tekstprintlnf("Button pressed: %s", ButtonNames[i].c_str());
      found = true;
      ReworkIRremoteValue(i);
      return i;
    }
  }
  
  if (!found)
  {
    Tekstprintlnf("Unknown button - Protocol: %s, Command: 0x%04X, Address: 0x%04X", getProtocolString(protocol), command, address);
    ReworkIRremoteValue(-1);
    return -1;
  } 
 return -1;
}

//--------------------------------------------                                                //
// IR-RECEIVER ReworkRemoteValue
// String ButtonNames[] = {"0", "1", "2", "3", "4", "5", "6", "7", "8", "9",
//                        "UP", "DOWN", "LEFT", "RIGHT", "POWER", "OK"};
//  Button "POWER" and "ONOFF" can work without POWER ON
//--------------------------------------------
void ReworkIRremoteValue(int ButtonNamesNr)
{
 String ButtonName = ButtonNames[ButtonNamesNr]; 
 String DisplayOption = "Q0";
 if (ButtonNamesNr == -1)  {Tekstprintln("Unknown button - ignored");  return;  }

